//MWILSONS JOB CLASS=A,MSGCLASS=X
//DEBUG   EXEC PGM=MVSDDT,PARM=CTCSERV,REGION=128K
//STEPLIB   DD DISP=SHR,DSN=MWILSON.LOAD
//CTCCMD    DD UNIT=502,DISP=OLD
//CTCDATA   DD UNIT=503,DISP=OLD
//SYSPRINT  DD SYSOUT=*
//SYSABEND  DD SYSOUT=*
//#DDTCMD   DD UNIT=500
//#DDTDATA  DD UNIT=501
//
